{
  "common": {
    "some_page": "A not available page",
    "in_progress": "in progress",
    "short_language": "en",
    "short_locale": "en-us"
  },
  "settings": {
    "display_preferences": "Display Preferences"
  },
  "views": {
    "standard": {
      "error_404": {
        "main": "Page not found."
      }
    },
    "welcome": {
      "index": {
        "short_link": "Home",
        "welcome": "Welcome to my portfolio!",
        "in_progress_statement": "I'm still working on some features and content on my portfolio, so while it would be a good idea for an engineer to look at the code base to get a good idea of my front end and general web development skills, it doesn't yet have a lot of content highlighting my achievements and capabilities."
      }
    },
    "schedule": {
      "index": {
        "short_link": "Schedule",
        "short_title": "Schedule",
        "long_title": "Samuel's availability for meetings and such"
      }
    },
    "resume": {
      "index": {
        "short_link": "Resume",
        "resource_url": "https://storage.googleapis.com/portfolio-media/Samuel%20Frost%20Resume.pdf"
      }
    },
    "projects": {
      "models": {
        "3d_models_index": {
          "short_link": "3d models",
          "object_description_microRoom": "I have an interest in minimalist living, and so I was inspired to make some designs for what I was calling micro-rooms. The idea was to try to use concrete in the construction to limit vibration/sound transfer. I've since learned a lot about the subject and would definitely design these differently now.",
          "object_description_house": "A to scale model of my real estate project which I created from scratch and used to obtain building permits. I've left out some planning layers such as vegetation and elevation to prevent clutter.",
          "object_description_balcony": "This is a quick sketch up of my apartment's balcony and some furniture. I was considering purchasing something online and wanted to see how it would fit in with the existing objects and awkwardly shaped architecture. (white objects already present, red being considered)",
          "object_name_microRoom": "Micro Room",
          "object_name_house": "House / Real Estate",
          "object_name_balcony": "Balcony"
        }
      },
      "portfolio": {
        "index": {
          "title": "About this portfolio",
          "short_link": "Portfolio",
          "why_worth_mentioning": "Using the no framework framework",
          "no_framework_native_apis": "This site has equivalent features of a modern frontend framework, but doesn't buy into any particular one. I do this by using the same APIs used when creating native browser elements.",
          "no_framework_benefits": "This approach provides major benefits to me as a developer as well as the end users. <br>As a developer I am able to use solutions from any source and can easily swap out solutions if they become outdated or don't work for new use cases. Additionally I get to work close with the APIs that frameworks would traditionally abstract away from the developer, this gives me more control and more customizability to make what I want. <br>For my users, as I don't need to load heavy libraries to begin showing them content and can control the entire experience, this means performance increases and an experience tailored to their needs.",
          "scalability": "Scalability",
          "scalability_explanation": "As applications grow in size, the amount of data that needs to be sent and processed also grows. This means we need to find strategies to reduce data transfer and wasted processing times.",
          "pre-rendering": "I started my web development career at a company that didn't use much front end rendering via JavaScript, only getting pre-rendered html from the server except in rare cases. This can actually be really good for client side rendering times and computer resources; that said, it makes it where static pages and such can't be handled without asking the server how to do it. Typically the server will have to render several templates and in many cases will have to process and expand the data being sent into structured html. This increases server processing load and data transfer, slowing down responses and driving up server costs. Additionally as users often navigate the same pages many times, the uncacheable nature of this strategy creates a lot of unnecessary traffic on the server.",
          "spa_scalability": "Single page applications (SPAs) like this portfolio take the opposite approach to this (though you could have a fallback for compatibility reasons). A SPA will send the templating logic to the user, and then only send the data necessary to update when the user needs it. This means servers can send only the data needed and usually need a minimal amount of processing to get it in a compatible format. Additionally static pages and otherwise already up to date pages can be rendered without any further requests to the server.",
          "web_vitals_and_metrics": "Web Vitals and Metrics",
          "web_vitals_explanation": "Lately Google has been pushing for developers to start following better practices when it comes to making good websites. \"Web Vitals is an initiative by Google to provide unified guidance for quality signals that are essential to delivering a great user experience on the web.\"",
          "web_vitals_tools": "With this move Google has also introduced some wonderful tools and standards for us developers to be able to objectively monitor how well we're doing. While some nuances of the user experience are not captured, this gives us something to keep ourselves in check and aim for when developing.",
          "web_vitals_measure_try_it_yourself": "Try it yourself: ",
          "my_web_vitals": "I've been keeping track of my site's performance, here's what my report over time has looked like: ",
          "my_web_vitals_personal_usefulness": "As you can see, I've been maintaining a flawless score since nearly the start of my project. By running this test frequently I've been able to identify issues and resolve them immediately when they appear. An interesting side effect of trying to optimize these metrics is that as a developer I learned things about SEO and Accessibility that would have otherwise required extensive research/experience focusing on those fields.",
          "project_management": "Project Management with Asana",
          "project_management_asana": "As this project has a few more features than your run of the mill website, I've decided to keep myself on track using Asana. Normally Asana is used to help teams keep organized and working fluidly in teams using an agile management style. I've found however that keeping track of my ideas for features and treating them as tasks/tickets helps me keep on track and manage priorities, especially when I take a break from a project.",
          "the_future_of_this_project_and_the_web": "The future of this project and the web",
          "pwa": "While I'm still considering my web worker strategy, this page is a ultimately a PWA (or will be once I decide how I want to set my web worker up). Web workers allow a website to handle requests while offline, to store data, fetch updates in the background, send push notifications, and much more. These features allow for a website to act like a native application, and in fact with a web manifest, this will allow a website to be downloaded and used like any other application (desktop or mobile, no separate development process). Because of this, I believe the web is on its way to replacing native applications.",
          "web_development_future": "If we truly intend to replace our native applications with the web, we need to ensure we don't sacrifice the experience. This is why having an intimate understanding of the base APIs/engines we work with is important to me as a developer and thus ultimately why I choose to develop without a front end framework."
        }
      }
    }
  }
}